; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v5 ?v2)
             (pred_3 ?v10 ?v3)
             (pred_8 ?v5 ?v3)
             (pred_4 ?v11 ?v5 )
	     (pred_11 ?v5)
             (pred_10 ?v4)
             (pred_5 ?v10)
             (pred_9 ?v3)
             (pred_2 ?v5)
             (pred_1 ?v10)
             (pred_6 ?v5)
             (pred_7 ))



(:action op_3
:parameters (?v7 ?v13 ?v8 ?v6)
:precondition (and (pred_10 ?v7) (pred_10 ?v13) (pred_5 ?v8) (pred_9 ?v6)
          (pred_12 ?v7 ?v13) (pred_3 ?v8 ?v6)
                   (pred_8 ?v13 ?v6) (pred_11 ?v7) 
                   (pred_2 ?v13) (pred_1 ?v8))
:effect (and  (pred_6 ?v13) (not (pred_2 ?v13))))


(:action op_2
:parameters (?v7 ?v12)
:precondition (and (pred_10 ?v7) (pred_10 ?v12)
               (pred_11 ?v7) (pred_12 ?v7 ?v12) (pred_6 ?v12))
:effect (and (pred_11 ?v12) (not (pred_11 ?v7))))

(:action op_5
:parameters (?v7 ?v8)
:precondition (and (pred_10 ?v7) (pred_5 ?v8) 
                  (pred_11 ?v7) (pred_4 ?v8 ?v7) (pred_7 ))
:effect (and (pred_1 ?v8)
   (not (pred_4 ?v8 ?v7)) (not (pred_7 ))))


(:action op_1
:parameters (?v7 ?v9 ?v1)
:precondition (and (pred_10 ?v7) (pred_5 ?v9) (pred_5 ?v1)
                  (pred_11 ?v7) (pred_1 ?v1) (pred_4 ?v9 ?v7))
:effect (and (pred_1 ?v9) (pred_4 ?v1 ?v7)
        (not (pred_1 ?v1)) (not (pred_4 ?v9 ?v7))))

(:action op_4
:parameters (?v7 ?v8)
:precondition (and (pred_10 ?v7) (pred_5 ?v8) 
                  (pred_11 ?v7) (pred_1 ?v8))
:effect (and (pred_7 ) (pred_4 ?v8 ?v7) (not (pred_1 ?v8)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_03 obj_11 obj_01 obj_13 obj_02 obj_12 obj_09 obj_08 obj_05
    obj_10 obj_04
    obj_07 obj_06
    )

    (:init
       (pred_7)

       (pred_10 obj_03)
       (pred_10 obj_11)
       (pred_10 obj_01)
       (pred_10 obj_13)
       (pred_10 obj_02)
       (pred_10 obj_12)
       (pred_10 obj_09)
       (pred_10 obj_08)
       (pred_10 obj_05)
       (pred_9 obj_10)
       (pred_9 obj_04)
       (pred_5 obj_07)
       (pred_5 obj_06)

       (pred_12 obj_03 obj_13)
       (pred_12 obj_03 obj_11)
       (pred_12 obj_11 obj_02)
       (pred_12 obj_11 obj_01)
       (pred_12 obj_11 obj_03)
       (pred_12 obj_01 obj_12)
       (pred_12 obj_01 obj_11)
       (pred_12 obj_13 obj_09)
       (pred_12 obj_13 obj_02)
       (pred_12 obj_13 obj_03)
       (pred_12 obj_02 obj_08)
       (pred_12 obj_02 obj_12)
       (pred_12 obj_02 obj_11)
       (pred_12 obj_02 obj_13)
       (pred_12 obj_12 obj_05)
       (pred_12 obj_12 obj_01)
       (pred_12 obj_12 obj_02)
       (pred_12 obj_09 obj_08)
       (pred_12 obj_09 obj_13)
       (pred_12 obj_08 obj_05)
       (pred_12 obj_08 obj_02)
       (pred_12 obj_08 obj_09)
       (pred_12 obj_05 obj_12)
       (pred_12 obj_05 obj_08)
       (pred_2 obj_09)
       (pred_2 obj_13)
       (pred_8  obj_09 obj_10)
       (pred_8  obj_13 obj_04)
       (pred_6 obj_03)
       (pred_6 obj_11)
       (pred_6 obj_01)
       (pred_6 obj_02)
       (pred_6 obj_12)
       (pred_6 obj_08)
       (pred_6 obj_05)

       (pred_3  obj_07 obj_10)
       (pred_3  obj_06 obj_04)
       (pred_4 obj_07 obj_05)
       (pred_4 obj_06 obj_03)
       (pred_11 obj_08)
    )

    (:goal (and
       (pred_4 obj_06 obj_13)
    ))
(:constraints
  (always (not (pred_11 obj_02)))
)
)

; plan
1. (op_2 obj_08 obj_05)
   deleted: (pred_11 obj_08)
   added: (pred_11 obj_05)
   goals met: 0 of 1
2. (op_2 obj_05 obj_12)
   deleted: (pred_11 obj_05)
   added: (pred_11 obj_12)
   goals met: 0 of 1
3. (op_2 obj_12 obj_01)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_01)
   goals met: 0 of 1
4. (op_2 obj_01 obj_11)
   deleted: (pred_11 obj_01)
   added: (pred_11 obj_11)
   goals met: 0 of 1
5. (op_2 obj_11 obj_03)
   deleted: (pred_11 obj_11)
   added: (pred_11 obj_03)
   goals met: 0 of 1
6. (op_5 obj_03 obj_06)
   deleted: (pred_4 obj_06 obj_03) (pred_7)
   added: (pred_1 obj_06)
   goals met: 0 of 1
7. (op_3 obj_03 obj_13 obj_06 obj_04)
   deleted: (pred_2 obj_13)
   added: (pred_6 obj_13)
   goals met: 0 of 1
8. (op_2 obj_03 obj_13)
   deleted: (pred_11 obj_03)
   added: (pred_11 obj_13)
   goals met: 0 of 1
9. (op_4 obj_13 obj_06)
   deleted: (pred_1 obj_06)
   added: (pred_7) (pred_4 obj_06 obj_13)
   goals met: 1 of 1
